# Core CLI tools
brew "starship"
brew "fzf"
brew "eza"
brew "bat"           # Better cat (used in zshrc + FZF preview)
brew "zoxide"        # Smart cd (used in zshrc)
brew "ripgrep"       # Fast file search (used by FZF_DEFAULT_COMMAND)
brew "lazygit"       # Visual git TUI
brew "thefuck"       # Correct mistyped commands
brew "fnm"           # Node version manager (replaces static brew node)
brew "gh"            # GitHub CLI — create repos, PRs, issues from terminal

# ZSH plugins
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Optional CLI tools
brew "tree"
brew "rsync"         # Used by cpv alias in zshrc

# GUI Apps
cask "visual-studio-code"
cask "wezterm"
cask "iterm2"
cask "karabiner-elements"

# Productivity / Utilities
cask "raycast"
cask "appcleaner"
cask "the-unarchiver"
cask "hiddenbar"
cask "contexts"

# Browsers / Media
cask "google-chrome"
cask "iina"

# Extras
cask "cleanshot"
cask "popclip"
cask "itsycal"
cask "keyboardcleantool"
cask "mic-drop"

# Fonts
cask "font-meslo-lg-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code"
