# Core CLI tools
brew "neovim"
brew "node"
brew "starship"
brew "fzf"
brew "eza"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"

# Optional CLI tools
brew "tree"

# GUI Apps
cask "visual-studio-code"
cask "wezterm"
cask "iterm2"
cask "karabiner-elements"

# Productivity / Utilities
cask "raycast"
cask "appcleaner"
cask "the-unarchiver"
cask "hiddenbar"
cask "contexts"

# Browsers / Media
cask "google-chrome"
cask "iina"

# Extras
cask "cleanshot"
cask "popclip"
cask "itsycal"
cask "keyboardcleantool"
cask "mic-drop"

# Fonts
cask "font-meslo-lg-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code"
